GopalSaraf/Practicals/PSDL/include/proc/pic18f04q40.h
// Register: U2RXPPS
#define U2RXPPS U2RXPPS
extern volatile unsigned char           U2RXPPS             __at(0x274);
#ifndef _LIB_BUILD
asm("U2RXPPS equ 0274h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned U2RXPPS                :6;
    };
    struct {
        unsigned U2RXPPS0               :1;
        unsigned U2RXPPS1               :1;
        unsigned U2RXPPS2               :1;
        unsigned U2RXPPS3               :1;
        unsigned U2RXPPS4               :1;
        unsigned U2RXPPS5               :1;
    };
} U2RXPPSbits_t;
extern volatile U2RXPPSbits_t U2RXPPSbits __at(0x274);
// bitfield macros
#define _U2RXPPS_PIN_POSN                                   0x0
#define _U2RXPPS_PIN_POSITION                               0x0
#define _U2RXPPS_PIN_SIZE                                   0x3
#define _U2RXPPS_PIN_LENGTH                                 0x3
#define _U2RXPPS_PIN_MASK                                   0x7
#define _U2RXPPS_PORT_POSN                                  0x3
#define _U2RXPPS_PORT_POSITION                              0x3
#define _U2RXPPS_PORT_SIZE                                  0x3
#define _U2RXPPS_PORT_LENGTH                                0x3
#define _U2RXPPS_PORT_MASK                                  0x38
#define _U2RXPPS_U2RXPPS_POSN                               0x0
#define _U2RXPPS_U2RXPPS_POSITION                           0x0
#define _U2RXPPS_U2RXPPS_SIZE                               0x6
#define _U2RXPPS_U2RXPPS_LENGTH                             0x6
#define _U2RXPPS_U2RXPPS_MASK                               0x3F
#define _U2RXPPS_U2RXPPS0_POSN                              0x0
#define _U2RXPPS_U2RXPPS0_POSITION                          0x0
#define _U2RXPPS_U2RXPPS0_SIZE                              0x1
#define _U2RXPPS_U2RXPPS0_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS0_MASK                              0x1
#define _U2RXPPS_U2RXPPS1_POSN                              0x1
#define _U2RXPPS_U2RXPPS1_POSITION                          0x1
#define _U2RXPPS_U2RXPPS1_SIZE                              0x1
#define _U2RXPPS_U2RXPPS1_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS1_MASK                              0x2
#define _U2RXPPS_U2RXPPS2_POSN                              0x2
#define _U2RXPPS_U2RXPPS2_POSITION                          0x2
#define _U2RXPPS_U2RXPPS2_SIZE                              0x1
#define _U2RXPPS_U2RXPPS2_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS2_MASK                              0x4
#define _U2RXPPS_U2RXPPS3_POSN                              0x3
#define _U2RXPPS_U2RXPPS3_POSITION                          0x3
#define _U2RXPPS_U2RXPPS3_SIZE                              0x1
#define _U2RXPPS_U2RXPPS3_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS3_MASK                              0x8
#define _U2RXPPS_U2RXPPS4_POSN                              0x4
#define _U2RXPPS_U2RXPPS4_POSITION                          0x4
#define _U2RXPPS_U2RXPPS4_SIZE                              0x1
#define _U2RXPPS_U2RXPPS4_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS4_MASK                              0x10
#define _U2RXPPS_U2RXPPS5_POSN                              0x5
#define _U2RXPPS_U2RXPPS5_POSITION                          0x5
#define _U2RXPPS_U2RXPPS5_SIZE                              0x1
#define _U2RXPPS_U2RXPPS5_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS5_MASK                              0x20

// Register: U2CTSPPS
#define U2CTSPPS U2CTSPPS
extern volatile unsigned char           U2CTSPPS            __at(0x275);
#ifndef _LIB_BUILD
asm("U2CTSPPS equ 0275h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned U2CTSPPS               :6;
    };
    struct {
        unsigned U2CTSPPS0              :1;
        unsigned U2CTSPPS1              :1;
        unsigned U2CTSPPS2              :1;
        unsigned U2CTSPPS3              :1;
        unsigned U2CTSPPS4              :1;
        unsigned U2CTSPPS5              :1;
    };
} U2CTSPPSbits_t;
extern volatile U2CTSPPSbits_t U2CTSPPSbits __at(0x275);
// bitfield macros
#define _U2CTSPPS_PIN_POSN                                  0x0
#define _U2CTSPPS_PIN_POSITION                              0x0
#define _U2CTSPPS_PIN_SIZE                                  0x3
#define _U2CTSPPS_PIN_LENGTH                                0x3
#define _U2CTSPPS_PIN_MASK                                  0x7
#define _U2CTSPPS_PORT_POSN                                 0x3
#define _U2CTSPPS_PORT_POSITION                             0x3
#define _U2CTSPPS_PORT_SIZE                                 0x3
#define _U2CTSPPS_PORT_LENGTH                               0x3
#define _U2CTSPPS_PORT_MASK                                 0x38
#define _U2CTSPPS_U2CTSPPS_POSN                             0x0
#define _U2CTSPPS_U2CTSPPS_POSITION                         0x0
#define _U2CTSPPS_U2CTSPPS_SIZE                             0x6
#define _U2CTSPPS_U2CTSPPS_LENGTH                           0x6
#define _U2CTSPPS_U2CTSPPS_MASK                             0x3F
#define _U2CTSPPS_U2CTSPPS0_POSN                            0x0
#define _U2CTSPPS_U2CTSPPS0_POSITION                        0x0
#define _U2CTSPPS_U2CTSPPS0_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS0_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS0_MASK                            0x1
#define _U2CTSPPS_U2CTSPPS1_POSN                            0x1
#define _U2CTSPPS_U2CTSPPS1_POSITION                        0x1
#define _U2CTSPPS_U2CTSPPS1_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS1_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS1_MASK                            0x2
#define _U2CTSPPS_U2CTSPPS2_POSN                            0x2
#define _U2CTSPPS_U2CTSPPS2_POSITION                        0x2
#define _U2CTSPPS_U2CTSPPS2_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS2_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS2_MASK                            0x4
#define _U2CTSPPS_U2CTSPPS3_POSN                            0x3
#define _U2CTSPPS_U2CTSPPS3_POSITION                        0x3
#define _U2CTSPPS_U2CTSPPS3_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS3_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS3_MASK                            0x8
#define _U2CTSPPS_U2CTSPPS4_POSN                            0x4
#define _U2CTSPPS_U2CTSPPS4_POSITION                        0x4
#define _U2CTSPPS_U2CTSPPS4_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS4_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS4_MASK                            0x10
#define _U2CTSPPS_U2CTSPPS5_POSN                            0x5
#define _U2CTSPPS_U2CTSPPS5_POSITION                        0x5
#define _U2CTSPPS_U2CTSPPS5_SIZE                            0x1
#define _U2CTSPPS_U2CTSPPS5_LENGTH                          0x1
#define _U2CTSPPS_U2CTSPPS5_MASK                            0x20

// Register: U3RXPPS
#define U3RXPPS U3RXPPS
extern volatile unsigned char           U3RXPPS             __at(0x276);
#ifndef _LIB_BUILD
asm("U3RXPPS equ 0276h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned U3RXPPS                :6;
    };
    struct {
        unsigned U3RXPPS0               :1;
        unsigned U3RXPPS1               :1;
        unsigned U3RXPPS2               :1;
        unsigned U3RXPPS3               :1;
        unsigned U3RXPPS4               :1;
        unsigned U3RXPPS5               :1;
    };
} U3RXPPSbits_t;
extern volatile U3RXPPSbits_t U3RXPPSbits __at(0x276);
// bitfield macros
#define _U3RXPPS_PIN_POSN                                   0x0
#define _U3RXPPS_PIN_POSITION                               0x0
#define _U3RXPPS_PIN_SIZE                                   0x3
#define _U3RXPPS_PIN_LENGTH                                 0x3
#define _U3RXPPS_PIN_MASK                                   0x7
#define _U3RXPPS_PORT_POSN                                  0x3
#define _U3RXPPS_PORT_POSITION                              0x3
#define _U3RXPPS_PORT_SIZE                                  0x3
#define _U3RXPPS_PORT_LENGTH                                0x3
#define _U3RXPPS_PORT_MASK                                  0x38
#define _U3RXPPS_U3RXPPS_POSN                               0x0
#define _U3RXPPS_U3RXPPS_POSITION                           0x0
#define _U3RXPPS_U3RXPPS_SIZE                               0x6
#define _U3RXPPS_U3RXPPS_LENGTH                             0x6
#define _U3RXPPS_U3RXPPS_MASK                               0x3F
#define _U3RXPPS_U3RXPPS0_POSN                              0x0
#define _U3RXPPS_U3RXPPS0_POSITION                          0x0
#define _U3RXPPS_U3RXPPS0_SIZE                              0x1
#define _U3RXPPS_U3RXPPS0_LENGTH                            0x1
#define _U3RXPPS_U3RXPPS0_MASK                              0x1
#define _U3RXPPS_U3RXPPS1_POSN                              0x1
#define _U3RXPPS_U3RXPPS1_POSITION                          0x1
#define _U3RXPPS_U3RXPPS1_SIZE                              0x1
#define _U3RXPPS_U3RXPPS1_LENGTH                            0x1
#define _U3RXPPS_U3RXPPS1_MASK                              0x2
#define _U3RXPPS_U3RXPPS2_POSN                              0x2
#define _U3RXPPS_U3RXPPS2_POSITION                          0x2
#define _U3RXPPS_U3RXPPS2_SIZE                              0x1
#define _U3RXPPS_U3RXPPS2_LENGTH                            0x1
#define _U3RXPPS_U3RXPPS2_MASK                              0x4
#define _U3RXPPS_U3RXPPS3_POSN                              0x3
#define _U3RXPPS_U3RXPPS3_POSITION                          0x3
#define _U3RXPPS_U3RXPPS3_SIZE                              0x1
#define _U3RXPPS_U3RXPPS3_LENGTH                            0x1
#define _U3RXPPS_U3RXPPS3_MASK                              0x8
#define _U3RXPPS_U3RXPPS4_POSN                              0x4
#define _U3RXPPS_U3RXPPS4_POSITION                          0x4
#define _U3RXPPS_U3RXPPS4_SIZE                              0x1
#define _U3RXPPS_U3RXPPS4_LENGTH                            0x1
#define _U3RXPPS_U3RXPPS4_MASK                              0x10
#define _U3RXPPS_U3RXPPS5_POSN                              0x5
#define _U3RXPPS_U3RXPPS5_POSITION                          0x5
#define _U3RXPPS_U3RXPPS5_SIZE                              0x1
#define _U3RXPPS_U3RXPPS5_LENGTH                            0x1
#define _U3RXPPS_U3RXPPS5_MASK                              0x20

// Register: U3CTSPPS
#define U3CTSPPS U3CTSPPS
extern volatile unsigned char           U3CTSPPS            __at(0x277);
#ifndef _LIB_BUILD
asm("U3CTSPPS equ 0277h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned U3CTSPPS               :6;
    };
    struct {
        unsigned U3CTSPPS0              :1;
        unsigned U3CTSPPS1              :1;
        unsigned U3CTSPPS2              :1;
        unsigned U3CTSPPS3              :1;
        unsigned U3CTSPPS4              :1;
        unsigned U3CTSPPS5              :1;
    };
} U3CTSPPSbits_t;
extern volatile U3CTSPPSbits_t U3CTSPPSbits __at(0x277);
// bitfield macros
#define _U3CTSPPS_PIN_POSN                                  0x0
#define _U3CTSPPS_PIN_POSITION                              0x0
#define _U3CTSPPS_PIN_SIZE                                  0x3
#define _U3CTSPPS_PIN_LENGTH                                0x3
#define _U3CTSPPS_PIN_MASK                                  0x7
#define _U3CTSPPS_PORT_POSN                                 0x3
#define _U3CTSPPS_PORT_POSITION                             0x3
#define _U3CTSPPS_PORT_SIZE                                 0x3
#define _U3CTSPPS_PORT_LENGTH                               0x3
#define _U3CTSPPS_PORT_MASK                                 0x38
#define _U3CTSPPS_U3CTSPPS_POSN                             0x0
#define _U3CTSPPS_U3CTSPPS_POSITION                         0x0
#define _U3CTSPPS_U3CTSPPS_SIZE                             0x6
#define _U3CTSPPS_U3CTSPPS_LENGTH                           0x6
#define _U3CTSPPS_U3CTSPPS_MASK                             0x3F
#define _U3CTSPPS_U3CTSPPS0_POSN                            0x0
#define _U3CTSPPS_U3CTSPPS0_POSITION                        0x0
#define _U3CTSPPS_U3CTSPPS0_SIZE                            0x1
#define _U3CTSPPS_U3CTSPPS0_LENGTH                          0x1
#define _U3CTSPPS_U3CTSPPS0_MASK                            0x1
#define _U3CTSPPS_U3CTSPPS1_POSN                            0x1
#define _U3CTSPPS_U3CTSPPS1_POSITION                        0x1
#define _U3CTSPPS_U3CTSPPS1_SIZE                            0x1
#define _U3CTSPPS_U3CTSPPS1_LENGTH                          0x1
#define _U3CTSPPS_U3CTSPPS1_MASK                            0x2
#define _U3CTSPPS_U3CTSPPS2_POSN                            0x2
#define _U3CTSPPS_U3CTSPPS2_POSITION                        0x2
#define _U3CTSPPS_U3CTSPPS2_SIZE                            0x1
#define _U3CTSPPS_U3CTSPPS2_LENGTH                          0x1
#define _U3CTSPPS_U3CTSPPS2_MASK                            0x4
#define _U3CTSPPS_U3CTSPPS3_POSN                            0x3
#define _U3CTSPPS_U3CTSPPS3_POSITION                        0x3
#define _U3CTSPPS_U3CTSPPS3_SIZE                            0x1
#define _U3CTSPPS_U3CTSPPS3_LENGTH                          0x1
#define _U3CTSPPS_U3CTSPPS3_MASK                            0x8
#define _U3CTSPPS_U3CTSPPS4_POSN                            0x4
#define _U3CTSPPS_U3CTSPPS4_POSITION                        0x4
#define _U3CTSPPS_U3CTSPPS4_SIZE                            0x1
#define _U3CTSPPS_U3CTSPPS4_LENGTH                          0x1
#define _U3CTSPPS_U3CTSPPS4_MASK                            0x10
#define _U3CTSPPS_U3CTSPPS5_POSN                            0x5
#define _U3CTSPPS_U3CTSPPS5_POSITION                        0x5
#define _U3CTSPPS_U3CTSPPS5_SIZE                            0x1
#define _U3CTSPPS_U3CTSPPS5_LENGTH                          0x1
#define _U3CTSPPS_U3CTSPPS5_MASK                            0x20

// Register: RC1I2C
#define RC1I2C RC1I2C
extern volatile unsigned char           RC1I2C              __at(0x288);
#ifndef _LIB_BUILD
asm("RC1I2C equ 0288h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :2;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
        unsigned SLEW0                  :1;
        unsigned SLEW1                  :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :2;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
        unsigned I2CSLEW0               :1;
        unsigned I2CSLEW1               :1;
    };
} RC1I2Cbits_t;
extern volatile RC1I2Cbits_t RC1I2Cbits __at(0x288);
// bitfield macros
#define _RC1I2C_TH_POSN                                     0x0
#define _RC1I2C_TH_POSITION                                 0x0
#define _RC1I2C_TH_SIZE                                     0x2
#define _RC1I2C_TH_LENGTH                                   0x2
#define _RC1I2C_TH_MASK                                     0x3
#define _RC1I2C_PU_POSN                                     0x4
#define _RC1I2C_PU_POSITION                                 0x4
#define _RC1I2C_PU_SIZE                                     0x2
#define _RC1I2C_PU_LENGTH                                   0x2
#define _RC1I2C_PU_MASK                                     0x30
#define _RC1I2C_SLEW_POSN                                   0x6
#define _RC1I2C_SLEW_POSITION                               0x6
#define _RC1I2C_SLEW_SIZE                                   0x2
#define _RC1I2C_SLEW_LENGTH                                 0x2
#define _RC1I2C_SLEW_MASK                                   0xC0
#define _RC1I2C_TH0_POSN                                    0x0
#define _RC1I2C_TH0_POSITION                                0x0
#define _RC1I2C_TH0_SIZE                                    0x1
#define _RC1I2C_TH0_LENGTH                                  0x1
#define _RC1I2C_TH0_MASK                                    0x1
#define _RC1I2C_TH1_POSN                                    0x1
#define _RC1I2C_TH1_POSITION                                0x1
#define _RC1I2C_TH1_SIZE                                    0x1
#define _RC1I2C_TH1_LENGTH                                  0x1
#define _RC1I2C_TH1_MASK                                    0x2
#define _RC1I2C_PU0_POSN                                    0x4
#define _RC1I2C_PU0_POSITION                                0x4
#define _RC1I2C_PU0_SIZE                                    0x1
#define _RC1I2C_PU0_LENGTH                                  0x1
#define _RC1I2C_PU0_MASK                                    0x10
#define _RC1I2C_PU1_POSN                                    0x5
#define _RC1I2C_PU1_POSITION                                0x5
#define _RC1I2C_PU1_SIZE                                    0x1
#define _RC1I2C_PU1_LENGTH                                  0x1
#define _RC1I2C_PU1_MASK                                    0x20
#define _RC1I2C_SLEW0_POSN                                  0x6
#define _RC1I2C_SLEW0_POSITION                              0x6
#define _RC1I2C_SLEW0_SIZE                                  0x1
#define _RC1I2C_SLEW0_LENGTH                                0x1
#define _RC1I2C_SLEW0_MASK                                  0x40
#define _RC1I2C_SLEW1_POSN                                  0x7
#define _RC1I2C_SLEW1_POSITION                              0x7
#define _RC1I2C_SLEW1_SIZE                                  0x1
#define _RC1I2C_SLEW1_LENGTH                                0x1
#define _RC1I2C_SLEW1_MASK                                  0x80
#define _RC1I2C_I2CTH_POSN                                  0x0
#define _RC1I2C_I2CTH_POSITION                              0x0
#define _RC1I2C_I2CTH_SIZE                                  0x2
#define _RC1I2C_I2CTH_LENGTH                                0x2
#define _RC1I2C_I2CTH_MASK                                  0x3
#define _RC1I2C_I2CPU_POSN                                  0x4
#define _RC1I2C_I2CPU_POSITION                              0x4
#define _RC1I2C_I2CPU_SIZE                                  0x2
#define _RC1I2C_I2CPU_LENGTH                                0x2
#define _RC1I2C_I2CPU_MASK                                  0x30
#define _RC1I2C_I2CSLEW_POSN                                0x6
#define _RC1I2C_I2CSLEW_POSITION                            0x6
#define _RC1I2C_I2CSLEW_SIZE                                0x2
#define _RC1I2C_I2CSLEW_LENGTH                              0x2
#define _RC1I2C_I2CSLEW_MASK                                0xC0
#define _RC1I2C_I2CTH0_POSN                                 0x0
#define _RC1I2C_I2CTH0_POSITION                             0x0
#define _RC1I2C_I2CTH0_SIZE                                 0x1
#define _RC1I2C_I2CTH0_LENGTH                               0x1
#define _RC1I2C_I2CTH0_MASK                                 0x1
#define _RC1I2C_I2CTH1_POSN                                 0x1
#define _RC1I2C_I2CTH1_POSITION                             0x1
#define _RC1I2C_I2CTH1_SIZE                                 0x1
#define _RC1I2C_I2CTH1_LENGTH                               0x1
#define _RC1I2C_I2CTH1_MASK                                 0x2
#define _RC1I2C_I2CPU0_POSN                                 0x4
#define _RC1I2C_I2CPU0_POSITION                             0x4
#define _RC1I2C_I2CPU0_SIZE                                 0x1
#define _RC1I2C_I2CPU0_LENGTH                               0x1
#define _RC1I2C_I2CPU0_MASK                                 0x10
#define _RC1I2C_I2CPU1_POSN                                 0x5
#define _RC1I2C_I2CPU1_POSITION                             0x5
#define _RC1I2C_I2CPU1_SIZE                                 0x1
#define _RC1I2C_I2CPU1_LENGTH                               0x1
#define _RC1I2C_I2CPU1_MASK                                 0x20
#define _RC1I2C_I2CSLEW0_POSN                               0x6
#define _RC1I2C_I2CSLEW0_POSITION                           0x6
#define _RC1I2C_I2CSLEW0_SIZE                               0x1
#define _RC1I2C_I2CSLEW0_LENGTH                             0x1
#define _RC1I2C_I2CSLEW0_MASK                               0x40
#define _RC1I2C_I2CSLEW1_POSN                               0x7
#define _RC1I2C_I2CSLEW1_POSITION                           0x7
#define _RC1I2C_I2CSLEW1_SIZE                               0x1
#define _RC1I2C_I2CSLEW1_LENGTH                             0x1
#define _RC1I2C_I2CSLEW1_MASK                               0x80

