GopalSaraf/Practicals/PSDL/include/proc/pic18f04q40.h
// Register: IPR6
#define IPR6 IPR6
extern volatile unsigned char           IPR6                __at(0x36D);
#ifndef _LIB_BUILD
asm("IPR6 equ 036Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IP                 :1;
        unsigned                        :1;
        unsigned CWG1IP                 :1;
        unsigned NCO1IP                 :1;
        unsigned DMA2SCNTIP             :1;
        unsigned DMA2DCNTIP             :1;
        unsigned DMA2ORIP               :1;
        unsigned DMA2AIP                :1;
    };
} IPR6bits_t;
extern volatile IPR6bits_t IPR6bits __at(0x36D);
// bitfield macros
#define _IPR6_INT1IP_POSN                                   0x0
#define _IPR6_INT1IP_POSITION                               0x0
#define _IPR6_INT1IP_SIZE                                   0x1
#define _IPR6_INT1IP_LENGTH                                 0x1
#define _IPR6_INT1IP_MASK                                   0x1
#define _IPR6_CWG1IP_POSN                                   0x2
#define _IPR6_CWG1IP_POSITION                               0x2
#define _IPR6_CWG1IP_SIZE                                   0x1
#define _IPR6_CWG1IP_LENGTH                                 0x1
#define _IPR6_CWG1IP_MASK                                   0x4
#define _IPR6_NCO1IP_POSN                                   0x3
#define _IPR6_NCO1IP_POSITION                               0x3
#define _IPR6_NCO1IP_SIZE                                   0x1
#define _IPR6_NCO1IP_LENGTH                                 0x1
#define _IPR6_NCO1IP_MASK                                   0x8
#define _IPR6_DMA2SCNTIP_POSN                               0x4
#define _IPR6_DMA2SCNTIP_POSITION                           0x4
#define _IPR6_DMA2SCNTIP_SIZE                               0x1
#define _IPR6_DMA2SCNTIP_LENGTH                             0x1
#define _IPR6_DMA2SCNTIP_MASK                               0x10
#define _IPR6_DMA2DCNTIP_POSN                               0x5
#define _IPR6_DMA2DCNTIP_POSITION                           0x5
#define _IPR6_DMA2DCNTIP_SIZE                               0x1
#define _IPR6_DMA2DCNTIP_LENGTH                             0x1
#define _IPR6_DMA2DCNTIP_MASK                               0x20
#define _IPR6_DMA2ORIP_POSN                                 0x6
#define _IPR6_DMA2ORIP_POSITION                             0x6
#define _IPR6_DMA2ORIP_SIZE                                 0x1
#define _IPR6_DMA2ORIP_LENGTH                               0x1
#define _IPR6_DMA2ORIP_MASK                                 0x40
#define _IPR6_DMA2AIP_POSN                                  0x7
#define _IPR6_DMA2AIP_POSITION                              0x7
#define _IPR6_DMA2AIP_SIZE                                  0x1
#define _IPR6_DMA2AIP_LENGTH                                0x1
#define _IPR6_DMA2AIP_MASK                                  0x80

// Register: IPR7
#define IPR7 IPR7
extern volatile unsigned char           IPR7                __at(0x36E);
#ifndef _LIB_BUILD
asm("IPR7 equ 036Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1RXIP               :1;
        unsigned I2C1TXIP               :1;
        unsigned I2C1IP                 :1;
        unsigned I2C1EIP                :1;
        unsigned                        :1;
        unsigned CLC3IP                 :1;
        unsigned PWM3PIP                :1;
        unsigned PWM3IP                 :1;
    };
} IPR7bits_t;
extern volatile IPR7bits_t IPR7bits __at(0x36E);
// bitfield macros
#define _IPR7_I2C1RXIP_POSN                                 0x0
#define _IPR7_I2C1RXIP_POSITION                             0x0
#define _IPR7_I2C1RXIP_SIZE                                 0x1
#define _IPR7_I2C1RXIP_LENGTH                               0x1
#define _IPR7_I2C1RXIP_MASK                                 0x1
#define _IPR7_I2C1TXIP_POSN                                 0x1
#define _IPR7_I2C1TXIP_POSITION                             0x1
#define _IPR7_I2C1TXIP_SIZE                                 0x1
#define _IPR7_I2C1TXIP_LENGTH                               0x1
#define _IPR7_I2C1TXIP_MASK                                 0x2
#define _IPR7_I2C1IP_POSN                                   0x2
#define _IPR7_I2C1IP_POSITION                               0x2
#define _IPR7_I2C1IP_SIZE                                   0x1
#define _IPR7_I2C1IP_LENGTH                                 0x1
#define _IPR7_I2C1IP_MASK                                   0x4
#define _IPR7_I2C1EIP_POSN                                  0x3
#define _IPR7_I2C1EIP_POSITION                              0x3
#define _IPR7_I2C1EIP_SIZE                                  0x1
#define _IPR7_I2C1EIP_LENGTH                                0x1
#define _IPR7_I2C1EIP_MASK                                  0x8
#define _IPR7_CLC3IP_POSN                                   0x5
#define _IPR7_CLC3IP_POSITION                               0x5
#define _IPR7_CLC3IP_SIZE                                   0x1
#define _IPR7_CLC3IP_LENGTH                                 0x1
#define _IPR7_CLC3IP_MASK                                   0x20
#define _IPR7_PWM3PIP_POSN                                  0x6
#define _IPR7_PWM3PIP_POSITION                              0x6
#define _IPR7_PWM3PIP_SIZE                                  0x1
#define _IPR7_PWM3PIP_LENGTH                                0x1
#define _IPR7_PWM3PIP_MASK                                  0x40
#define _IPR7_PWM3IP_POSN                                   0x7
#define _IPR7_PWM3IP_POSITION                               0x7
#define _IPR7_PWM3IP_SIZE                                   0x1
#define _IPR7_PWM3IP_LENGTH                                 0x1
#define _IPR7_PWM3IP_MASK                                   0x80

// Register: IPR8
#define IPR8 IPR8
extern volatile unsigned char           IPR8                __at(0x36F);
#ifndef _LIB_BUILD
asm("IPR8 equ 036Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2RXIP                 :1;
        unsigned U2TXIP                 :1;
        unsigned U2EIP                  :1;
        unsigned U2IP                   :1;
        unsigned                        :1;
        unsigned CLC4IP                 :1;
        unsigned                        :1;
        unsigned SCANIP                 :1;
    };
} IPR8bits_t;
