GopalSaraf/Practicals/PSDL/include/proc/pic18f04q40.h
extern volatile FSCMCONbits_t FSCMCONbits __at(0x458);
// bitfield macros
#define _FSCMCON_FSCMFEV_POSN                               0x0
#define _FSCMCON_FSCMFEV_POSITION                           0x0
#define _FSCMCON_FSCMFEV_SIZE                               0x1
#define _FSCMCON_FSCMFEV_LENGTH                             0x1
#define _FSCMCON_FSCMFEV_MASK                               0x1
#define _FSCMCON_FSCMFFI_POSN                               0x1
#define _FSCMCON_FSCMFFI_POSITION                           0x1
#define _FSCMCON_FSCMFFI_SIZE                               0x1
#define _FSCMCON_FSCMFFI_LENGTH                             0x1
#define _FSCMCON_FSCMFFI_MASK                               0x2
#define _FSCMCON_FSCMPEV_POSN                               0x2
#define _FSCMCON_FSCMPEV_POSITION                           0x2
#define _FSCMCON_FSCMPEV_SIZE                               0x1
#define _FSCMCON_FSCMPEV_LENGTH                             0x1
#define _FSCMCON_FSCMPEV_MASK                               0x4
#define _FSCMCON_FSCMPFI_POSN                               0x3
#define _FSCMCON_FSCMPFI_POSITION                           0x3
#define _FSCMCON_FSCMPFI_SIZE                               0x1
#define _FSCMCON_FSCMPFI_LENGTH                             0x1
#define _FSCMCON_FSCMPFI_MASK                               0x8
#define _FSCMCON_FSCMSEV_POSN                               0x4
#define _FSCMCON_FSCMSEV_POSITION                           0x4
#define _FSCMCON_FSCMSEV_SIZE                               0x1
#define _FSCMCON_FSCMSEV_LENGTH                             0x1
#define _FSCMCON_FSCMSEV_MASK                               0x10
#define _FSCMCON_FSCMSFI_POSN                               0x5
#define _FSCMCON_FSCMSFI_POSITION                           0x5
#define _FSCMCON_FSCMSFI_SIZE                               0x1
#define _FSCMCON_FSCMSFI_LENGTH                             0x1
#define _FSCMCON_FSCMSFI_MASK                               0x20

// Register: IVTLOCK
#define IVTLOCK IVTLOCK
extern volatile unsigned char           IVTLOCK             __at(0x459);
#ifndef _LIB_BUILD
asm("IVTLOCK equ 0459h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IVTLOCKED              :1;
    };
} IVTLOCKbits_t;
extern volatile IVTLOCKbits_t IVTLOCKbits __at(0x459);
// bitfield macros
#define _IVTLOCK_IVTLOCKED_POSN                             0x0
#define _IVTLOCK_IVTLOCKED_POSITION                         0x0
#define _IVTLOCK_IVTLOCKED_SIZE                             0x1
#define _IVTLOCK_IVTLOCKED_LENGTH                           0x1
#define _IVTLOCK_IVTLOCKED_MASK                             0x1

// Register: IVTAD
#define IVTAD IVTAD
#ifndef __CCI__
extern volatile __uint24                IVTAD               __at(0x45A);
#endif
#ifndef _LIB_BUILD
asm("IVTAD equ 045Ah");
#endif

// Register: IVTADL
#define IVTADL IVTADL
extern volatile unsigned char           IVTADL              __at(0x45A);
#ifndef _LIB_BUILD
asm("IVTADL equ 045Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AD0                    :1;
        unsigned AD1                    :1;
        unsigned AD2                    :1;
        unsigned AD3                    :1;
        unsigned AD4                    :1;
        unsigned AD5                    :1;
        unsigned AD6                    :1;
        unsigned AD7                    :1;
    };
} IVTADLbits_t;
extern volatile IVTADLbits_t IVTADLbits __at(0x45A);
// bitfield macros
#define _IVTADL_AD0_POSN                                    0x0
#define _IVTADL_AD0_POSITION                                0x0
#define _IVTADL_AD0_SIZE                                    0x1
#define _IVTADL_AD0_LENGTH                                  0x1
#define _IVTADL_AD0_MASK                                    0x1
#define _IVTADL_AD1_POSN                                    0x1
#define _IVTADL_AD1_POSITION                                0x1
#define _IVTADL_AD1_SIZE                                    0x1
#define _IVTADL_AD1_LENGTH                                  0x1
#define _IVTADL_AD1_MASK                                    0x2
#define _IVTADL_AD2_POSN                                    0x2
#define _IVTADL_AD2_POSITION                                0x2
#define _IVTADL_AD2_SIZE                                    0x1
#define _IVTADL_AD2_LENGTH                                  0x1
#define _IVTADL_AD2_MASK                                    0x4
#define _IVTADL_AD3_POSN                                    0x3
#define _IVTADL_AD3_POSITION                                0x3
#define _IVTADL_AD3_SIZE                                    0x1
#define _IVTADL_AD3_LENGTH                                  0x1
#define _IVTADL_AD3_MASK                                    0x8
#define _IVTADL_AD4_POSN                                    0x4
#define _IVTADL_AD4_POSITION                                0x4
#define _IVTADL_AD4_SIZE                                    0x1
#define _IVTADL_AD4_LENGTH                                  0x1
#define _IVTADL_AD4_MASK                                    0x10
#define _IVTADL_AD5_POSN                                    0x5
#define _IVTADL_AD5_POSITION                                0x5
#define _IVTADL_AD5_SIZE                                    0x1
#define _IVTADL_AD5_LENGTH                                  0x1
#define _IVTADL_AD5_MASK                                    0x20
#define _IVTADL_AD6_POSN                                    0x6
#define _IVTADL_AD6_POSITION                                0x6
#define _IVTADL_AD6_SIZE                                    0x1
#define _IVTADL_AD6_LENGTH                                  0x1
#define _IVTADL_AD6_MASK                                    0x40
#define _IVTADL_AD7_POSN                                    0x7
#define _IVTADL_AD7_POSITION                                0x7
#define _IVTADL_AD7_SIZE                                    0x1
#define _IVTADL_AD7_LENGTH                                  0x1
#define _IVTADL_AD7_MASK                                    0x80

// Register: IVTADH
#define IVTADH IVTADH
extern volatile unsigned char           IVTADH              __at(0x45B);
#ifndef _LIB_BUILD
asm("IVTADH equ 045Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AD8                    :1;
        unsigned AD9                    :1;
        unsigned AD10                   :1;
        unsigned AD11                   :1;
        unsigned AD12                   :1;
        unsigned AD13                   :1;
        unsigned AD14                   :1;
        unsigned AD15                   :1;
    };
} IVTADHbits_t;
