GopalSaraf/Practicals/PSDL/include/proc/pic18f04q40.h
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0x1E0B);	// @ (0x3C1 * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1STR<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0x1E20);	// @ (0x3C4 * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1STR,0)
// CWG1STR<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0x1E21);	// @ (0x3C4 * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1STR,1)
// CWG1STR<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0x1E22);	// @ (0x3C4 * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1STR,2)
// CWG1STR<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0x1E23);	// @ (0x3C4 * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1STR,3)
// CWG1PPS<CWGINPPS0>
extern volatile __bit                   CWGINPPS0           __at(0x12D8);	// @ (0x25B * 8 + 0)
#define                                 CWGINPPS0_bit       _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWGINPPS1>
extern volatile __bit                   CWGINPPS1           __at(0x12D9);	// @ (0x25B * 8 + 1)
#define                                 CWGINPPS1_bit       _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWGINPPS2>
extern volatile __bit                   CWGINPPS2           __at(0x12DA);	// @ (0x25B * 8 + 2)
#define                                 CWGINPPS2_bit       _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWGINPPS3>
extern volatile __bit                   CWGINPPS3           __at(0x12DB);	// @ (0x25B * 8 + 3)
#define                                 CWGINPPS3_bit       _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWGINPPS4>
extern volatile __bit                   CWGINPPS4           __at(0x12DC);	// @ (0x25B * 8 + 4)
#define                                 CWGINPPS4_bit       _BIT_ACCESS(CWG1PPS,4)
// CWG1PPS<CWGINPPS5>
extern volatile __bit                   CWGINPPS5           __at(0x12DD);	// @ (0x25B * 8 + 5)
#define                                 CWGINPPS5_bit       _BIT_ACCESS(CWG1PPS,5)
// CLCnSEL0<D1S0>
extern volatile __bit                   D1S0                __at(0x6C0);	// @ (0xD8 * 8 + 0)
#define                                 D1S0_bit            _BIT_ACCESS(CLCnSEL0,0)
// CLCnSEL0<D1S1>
extern volatile __bit                   D1S1                __at(0x6C1);	// @ (0xD8 * 8 + 1)
#define                                 D1S1_bit            _BIT_ACCESS(CLCnSEL0,1)
// CLCnSEL0<D1S2>
extern volatile __bit                   D1S2                __at(0x6C2);	// @ (0xD8 * 8 + 2)
#define                                 D1S2_bit            _BIT_ACCESS(CLCnSEL0,2)
// CLCnSEL0<D1S3>
extern volatile __bit                   D1S3                __at(0x6C3);	// @ (0xD8 * 8 + 3)
#define                                 D1S3_bit            _BIT_ACCESS(CLCnSEL0,3)
// CLCnSEL0<D1S4>
extern volatile __bit                   D1S4                __at(0x6C4);	// @ (0xD8 * 8 + 4)
#define                                 D1S4_bit            _BIT_ACCESS(CLCnSEL0,4)
// CLCnSEL0<D1S5>
extern volatile __bit                   D1S5                __at(0x6C5);	// @ (0xD8 * 8 + 5)
#define                                 D1S5_bit            _BIT_ACCESS(CLCnSEL0,5)
// CLCnSEL0<D1S6>
extern volatile __bit                   D1S6                __at(0x6C6);	// @ (0xD8 * 8 + 6)
#define                                 D1S6_bit            _BIT_ACCESS(CLCnSEL0,6)
// CLCnSEL1<D2S0>
extern volatile __bit                   D2S0                __at(0x6C8);	// @ (0xD9 * 8 + 0)
#define                                 D2S0_bit            _BIT_ACCESS(CLCnSEL1,0)
// CLCnSEL1<D2S1>
extern volatile __bit                   D2S1                __at(0x6C9);	// @ (0xD9 * 8 + 1)
#define                                 D2S1_bit            _BIT_ACCESS(CLCnSEL1,1)
// CLCnSEL1<D2S2>
extern volatile __bit                   D2S2                __at(0x6CA);	// @ (0xD9 * 8 + 2)
#define                                 D2S2_bit            _BIT_ACCESS(CLCnSEL1,2)
// CLCnSEL1<D2S3>
extern volatile __bit                   D2S3                __at(0x6CB);	// @ (0xD9 * 8 + 3)
#define                                 D2S3_bit            _BIT_ACCESS(CLCnSEL1,3)
// CLCnSEL1<D2S4>
extern volatile __bit                   D2S4                __at(0x6CC);	// @ (0xD9 * 8 + 4)
#define                                 D2S4_bit            _BIT_ACCESS(CLCnSEL1,4)
// CLCnSEL1<D2S5>
extern volatile __bit                   D2S5                __at(0x6CD);	// @ (0xD9 * 8 + 5)
#define                                 D2S5_bit            _BIT_ACCESS(CLCnSEL1,5)
// CLCnSEL1<D2S6>
extern volatile __bit                   D2S6                __at(0x6CE);	// @ (0xD9 * 8 + 6)
#define                                 D2S6_bit            _BIT_ACCESS(CLCnSEL1,6)
// CLCnSEL2<D3S0>
extern volatile __bit                   D3S0                __at(0x6D0);	// @ (0xDA * 8 + 0)
#define                                 D3S0_bit            _BIT_ACCESS(CLCnSEL2,0)
// CLCnSEL2<D3S1>
extern volatile __bit                   D3S1                __at(0x6D1);	// @ (0xDA * 8 + 1)
#define                                 D3S1_bit            _BIT_ACCESS(CLCnSEL2,1)
// CLCnSEL2<D3S2>
extern volatile __bit                   D3S2                __at(0x6D2);	// @ (0xDA * 8 + 2)
#define                                 D3S2_bit            _BIT_ACCESS(CLCnSEL2,2)
// CLCnSEL2<D3S3>
extern volatile __bit                   D3S3                __at(0x6D3);	// @ (0xDA * 8 + 3)
#define                                 D3S3_bit            _BIT_ACCESS(CLCnSEL2,3)
// CLCnSEL2<D3S4>
extern volatile __bit                   D3S4                __at(0x6D4);	// @ (0xDA * 8 + 4)
#define                                 D3S4_bit            _BIT_ACCESS(CLCnSEL2,4)
// CLCnSEL2<D3S5>
extern volatile __bit                   D3S5                __at(0x6D5);	// @ (0xDA * 8 + 5)
#define                                 D3S5_bit            _BIT_ACCESS(CLCnSEL2,5)
// CLCnSEL2<D3S6>
extern volatile __bit                   D3S6                __at(0x6D6);	// @ (0xDA * 8 + 6)
#define                                 D3S6_bit            _BIT_ACCESS(CLCnSEL2,6)
// CLCnSEL3<D4S0>
extern volatile __bit                   D4S0                __at(0x6D8);	// @ (0xDB * 8 + 0)
#define                                 D4S0_bit            _BIT_ACCESS(CLCnSEL3,0)
// CLCnSEL3<D4S1>
extern volatile __bit                   D4S1                __at(0x6D9);	// @ (0xDB * 8 + 1)
#define                                 D4S1_bit            _BIT_ACCESS(CLCnSEL3,1)
// CLCnSEL3<D4S2>
extern volatile __bit                   D4S2                __at(0x6DA);	// @ (0xDB * 8 + 2)
#define                                 D4S2_bit            _BIT_ACCESS(CLCnSEL3,2)
// CLCnSEL3<D4S3>
extern volatile __bit                   D4S3                __at(0x6DB);	// @ (0xDB * 8 + 3)
#define                                 D4S3_bit            _BIT_ACCESS(CLCnSEL3,3)
// CLCnSEL3<D4S4>
extern volatile __bit                   D4S4                __at(0x6DC);	// @ (0xDB * 8 + 4)
#define                                 D4S4_bit            _BIT_ACCESS(CLCnSEL3,4)
// CLCnSEL3<D4S5>
extern volatile __bit                   D4S5                __at(0x6DD);	// @ (0xDB * 8 + 5)
#define                                 D4S5_bit            _BIT_ACCESS(CLCnSEL3,5)
// CLCnSEL3<D4S6>
extern volatile __bit                   D4S6                __at(0x6DE);	// @ (0xDB * 8 + 6)
#define                                 D4S6_bit            _BIT_ACCESS(CLCnSEL3,6)
// DAC1CON<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x3FF);	// @ (0x7F * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON,7)
// PMD2<DAC1MD>
extern volatile __bit                   DAC1MD              __at(0x32A);	// @ (0x65 * 8 + 2)
#define                                 DAC1MD_bit          _BIT_ACCESS(PMD2,2)
// DAC1CON<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x3FA);	// @ (0x7F * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DAC1CON,2)
// DAC1CON<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x3FB);	// @ (0x7F * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DAC1CON,3)
// DAC1DATL<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x3E8);	// @ (0x7D * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1DATL,0)
// DAC1DATL<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x3E9);	// @ (0x7D * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1DATL,1)
// DAC1DATL<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x3EA);	// @ (0x7D * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1DATL,2)
// DAC1DATL<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x3EB);	// @ (0x7D * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1DATL,3)
// DAC1DATL<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x3EC);	// @ (0x7D * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1DATL,4)
// DAC1DATL<DAC1R5>
extern volatile __bit                   DAC1R5              __at(0x3ED);	// @ (0x7D * 8 + 5)
#define                                 DAC1R5_bit          _BIT_ACCESS(DAC1DATL,5)
// DAC1DATL<DAC1R6>
extern volatile __bit                   DAC1R6              __at(0x3EE);	// @ (0x7D * 8 + 6)
#define                                 DAC1R6_bit          _BIT_ACCESS(DAC1DATL,6)
// DAC1DATL<DAC1R7>
extern volatile __bit                   DAC1R7              __at(0x3EF);	// @ (0x7D * 8 + 7)
#define                                 DAC1R7_bit          _BIT_ACCESS(DAC1DATL,7)
// DAC2CON<DAC2EN>
extern volatile __bit                   DAC2EN              __at(0x517);	// @ (0xA2 * 8 + 7)
#define                                 DAC2EN_bit          _BIT_ACCESS(DAC2CON,7)
// PMD5<DAC2MD>
extern volatile __bit                   DAC2MD              __at(0x341);	// @ (0x68 * 8 + 1)
#define                                 DAC2MD_bit          _BIT_ACCESS(PMD5,1)
// DAC2CON<DAC2PSS0>
extern volatile __bit                   DAC2PSS0            __at(0x512);	// @ (0xA2 * 8 + 2)
#define                                 DAC2PSS0_bit        _BIT_ACCESS(DAC2CON,2)
// DAC2CON<DAC2PSS1>
extern volatile __bit                   DAC2PSS1            __at(0x513);	// @ (0xA2 * 8 + 3)
#define                                 DAC2PSS1_bit        _BIT_ACCESS(DAC2CON,3)
// DAC2DATL<DAC2R0>
extern volatile __bit                   DAC2R0              __at(0x500);	// @ (0xA0 * 8 + 0)
#define                                 DAC2R0_bit          _BIT_ACCESS(DAC2DATL,0)
// DAC2DATL<DAC2R1>
extern volatile __bit                   DAC2R1              __at(0x501);	// @ (0xA0 * 8 + 1)
#define                                 DAC2R1_bit          _BIT_ACCESS(DAC2DATL,1)
// DAC2DATL<DAC2R2>
extern volatile __bit                   DAC2R2              __at(0x502);	// @ (0xA0 * 8 + 2)
#define                                 DAC2R2_bit          _BIT_ACCESS(DAC2DATL,2)
// DAC2DATL<DAC2R3>
extern volatile __bit                   DAC2R3              __at(0x503);	// @ (0xA0 * 8 + 3)
#define                                 DAC2R3_bit          _BIT_ACCESS(DAC2DATL,3)
// DAC2DATL<DAC2R4>
extern volatile __bit                   DAC2R4              __at(0x504);	// @ (0xA0 * 8 + 4)
#define                                 DAC2R4_bit          _BIT_ACCESS(DAC2DATL,4)
// DAC2DATL<DAC2R5>
extern volatile __bit                   DAC2R5              __at(0x505);	// @ (0xA0 * 8 + 5)
#define                                 DAC2R5_bit          _BIT_ACCESS(DAC2DATL,5)
// DAC2DATL<DAC2R6>
extern volatile __bit                   DAC2R6              __at(0x506);	// @ (0xA0 * 8 + 6)
#define                                 DAC2R6_bit          _BIT_ACCESS(DAC2DATL,6)
// DAC2DATL<DAC2R7>
extern volatile __bit                   DAC2R7              __at(0x507);	// @ (0xA0 * 8 + 7)
#define                                 DAC2R7_bit          _BIT_ACCESS(DAC2DATL,7)
// I2C1STAT0<DATA>
extern volatile __bit                   DATA                __at(0x14C3);	// @ (0x298 * 8 + 3)
#define                                 DATA_bit            _BIT_ACCESS(I2C1STAT0,3)
// CRCDATAL<DATA0>
extern volatile __bit                   DATA0               __at(0x1A70);	// @ (0x34E * 8 + 0)
#define                                 DATA0_bit           _BIT_ACCESS(CRCDATAL,0)
// CRCDATAL<DATA1>
extern volatile __bit                   DATA1               __at(0x1A71);	// @ (0x34E * 8 + 1)
#define                                 DATA1_bit           _BIT_ACCESS(CRCDATAL,1)
// CRCDATAH<DATA10>
extern volatile __bit                   DATA10              __at(0x1A7A);	// @ (0x34F * 8 + 2)
#define                                 DATA10_bit          _BIT_ACCESS(CRCDATAH,2)
// CRCDATAH<DATA11>
extern volatile __bit                   DATA11              __at(0x1A7B);	// @ (0x34F * 8 + 3)
#define                                 DATA11_bit          _BIT_ACCESS(CRCDATAH,3)
// CRCDATAH<DATA12>
extern volatile __bit                   DATA12              __at(0x1A7C);	// @ (0x34F * 8 + 4)
#define                                 DATA12_bit          _BIT_ACCESS(CRCDATAH,4)
// CRCDATAH<DATA13>
extern volatile __bit                   DATA13              __at(0x1A7D);	// @ (0x34F * 8 + 5)
#define                                 DATA13_bit          _BIT_ACCESS(CRCDATAH,5)
// CRCDATAH<DATA14>
extern volatile __bit                   DATA14              __at(0x1A7E);	// @ (0x34F * 8 + 6)
#define                                 DATA14_bit          _BIT_ACCESS(CRCDATAH,6)
// CRCDATAH<DATA15>
extern volatile __bit                   DATA15              __at(0x1A7F);	// @ (0x34F * 8 + 7)
#define                                 DATA15_bit          _BIT_ACCESS(CRCDATAH,7)
// CRCDATAU<DATA16>
extern volatile __bit                   DATA16              __at(0x1A80);	// @ (0x350 * 8 + 0)
#define                                 DATA16_bit          _BIT_ACCESS(CRCDATAU,0)
// CRCDATAU<DATA17>
extern volatile __bit                   DATA17              __at(0x1A81);	// @ (0x350 * 8 + 1)
#define                                 DATA17_bit          _BIT_ACCESS(CRCDATAU,1)
// CRCDATAU<DATA18>
extern volatile __bit                   DATA18              __at(0x1A82);	// @ (0x350 * 8 + 2)
#define                                 DATA18_bit          _BIT_ACCESS(CRCDATAU,2)
// CRCDATAU<DATA19>
extern volatile __bit                   DATA19              __at(0x1A83);	// @ (0x350 * 8 + 3)
#define                                 DATA19_bit          _BIT_ACCESS(CRCDATAU,3)
// CRCDATAL<DATA2>
extern volatile __bit                   DATA2               __at(0x1A72);	// @ (0x34E * 8 + 2)
#define                                 DATA2_bit           _BIT_ACCESS(CRCDATAL,2)
// CRCDATAU<DATA20>
extern volatile __bit                   DATA20              __at(0x1A84);	// @ (0x350 * 8 + 4)
#define                                 DATA20_bit          _BIT_ACCESS(CRCDATAU,4)
// CRCDATAU<DATA21>
extern volatile __bit                   DATA21              __at(0x1A85);	// @ (0x350 * 8 + 5)
#define                                 DATA21_bit          _BIT_ACCESS(CRCDATAU,5)
// CRCDATAU<DATA22>
extern volatile __bit                   DATA22              __at(0x1A86);	// @ (0x350 * 8 + 6)
#define                                 DATA22_bit          _BIT_ACCESS(CRCDATAU,6)
// CRCDATAU<DATA23>
extern volatile __bit                   DATA23              __at(0x1A87);	// @ (0x350 * 8 + 7)
#define                                 DATA23_bit          _BIT_ACCESS(CRCDATAU,7)
// CRCDATAT<DATA24>
extern volatile __bit                   DATA24              __at(0x1A88);	// @ (0x351 * 8 + 0)
#define                                 DATA24_bit          _BIT_ACCESS(CRCDATAT,0)
// CRCDATAT<DATA25>
extern volatile __bit                   DATA25              __at(0x1A89);	// @ (0x351 * 8 + 1)
#define                                 DATA25_bit          _BIT_ACCESS(CRCDATAT,1)
// CRCDATAT<DATA26>
extern volatile __bit                   DATA26              __at(0x1A8A);	// @ (0x351 * 8 + 2)
#define                                 DATA26_bit          _BIT_ACCESS(CRCDATAT,2)
// CRCDATAT<DATA27>
extern volatile __bit                   DATA27              __at(0x1A8B);	// @ (0x351 * 8 + 3)
#define                                 DATA27_bit          _BIT_ACCESS(CRCDATAT,3)
// CRCDATAT<DATA28>
extern volatile __bit                   DATA28              __at(0x1A8C);	// @ (0x351 * 8 + 4)
#define                                 DATA28_bit          _BIT_ACCESS(CRCDATAT,4)
// CRCDATAT<DATA29>
extern volatile __bit                   DATA29              __at(0x1A8D);	// @ (0x351 * 8 + 5)
#define                                 DATA29_bit          _BIT_ACCESS(CRCDATAT,5)
// CRCDATAL<DATA3>
extern volatile __bit                   DATA3               __at(0x1A73);	// @ (0x34E * 8 + 3)
#define                                 DATA3_bit           _BIT_ACCESS(CRCDATAL,3)
// CRCDATAT<DATA30>
extern volatile __bit                   DATA30              __at(0x1A8E);	// @ (0x351 * 8 + 6)
#define                                 DATA30_bit          _BIT_ACCESS(CRCDATAT,6)
// CRCDATAT<DATA31>
extern volatile __bit                   DATA31              __at(0x1A8F);	// @ (0x351 * 8 + 7)
#define                                 DATA31_bit          _BIT_ACCESS(CRCDATAT,7)
// CRCDATAL<DATA4>
extern volatile __bit                   DATA4               __at(0x1A74);	// @ (0x34E * 8 + 4)
#define                                 DATA4_bit           _BIT_ACCESS(CRCDATAL,4)
// CRCDATAL<DATA5>
extern volatile __bit                   DATA5               __at(0x1A75);	// @ (0x34E * 8 + 5)
#define                                 DATA5_bit           _BIT_ACCESS(CRCDATAL,5)
// CRCDATAL<DATA6>
extern volatile __bit                   DATA6               __at(0x1A76);	// @ (0x34E * 8 + 6)
#define                                 DATA6_bit           _BIT_ACCESS(CRCDATAL,6)
// CRCDATAL<DATA7>
extern volatile __bit                   DATA7               __at(0x1A77);	// @ (0x34E * 8 + 7)
#define                                 DATA7_bit           _BIT_ACCESS(CRCDATAL,7)
// CRCDATAH<DATA8>
extern volatile __bit                   DATA8               __at(0x1A78);	// @ (0x34F * 8 + 0)
#define                                 DATA8_bit           _BIT_ACCESS(CRCDATAH,0)
// CRCDATAH<DATA9>
extern volatile __bit                   DATA9               __at(0x1A79);	// @ (0x34F * 8 + 1)
#define                                 DATA9_bit           _BIT_ACCESS(CRCDATAH,1)
// CWG1DBF<DBF0>
extern volatile __bit                   DBF0                __at(0x1DF8);	// @ (0x3BF * 8 + 0)
#define                                 DBF0_bit            _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<DBF1>
extern volatile __bit                   DBF1                __at(0x1DF9);	// @ (0x3BF * 8 + 1)
#define                                 DBF1_bit            _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<DBF2>
extern volatile __bit                   DBF2                __at(0x1DFA);	// @ (0x3BF * 8 + 2)
#define                                 DBF2_bit            _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<DBF3>
extern volatile __bit                   DBF3                __at(0x1DFB);	// @ (0x3BF * 8 + 3)
#define                                 DBF3_bit            _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<DBF4>
extern volatile __bit                   DBF4                __at(0x1DFC);	// @ (0x3BF * 8 + 4)
#define                                 DBF4_bit            _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<DBF5>
extern volatile __bit                   DBF5                __at(0x1DFD);	// @ (0x3BF * 8 + 5)
#define                                 DBF5_bit            _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<DBR0>
extern volatile __bit                   DBR0                __at(0x1DF0);	// @ (0x3BE * 8 + 0)
#define                                 DBR0_bit            _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<DBR1>
extern volatile __bit                   DBR1                __at(0x1DF1);	// @ (0x3BE * 8 + 1)
#define                                 DBR1_bit            _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<DBR2>
extern volatile __bit                   DBR2                __at(0x1DF2);	// @ (0x3BE * 8 + 2)
#define                                 DBR2_bit            _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<DBR3>
extern volatile __bit                   DBR3                __at(0x1DF3);	// @ (0x3BE * 8 + 3)
#define                                 DBR3_bit            _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<DBR4>
extern volatile __bit                   DBR4                __at(0x1DF4);	// @ (0x3BE * 8 + 4)
#define                                 DBR4_bit            _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<DBR5>
extern volatile __bit                   DBR5                __at(0x1DF5);	// @ (0x3BE * 8 + 5)
#define                                 DBR5_bit            _BIT_ACCESS(CWG1DBR,5)
// CLKRCON<DC0>
extern volatile __bit                   DC0                 __at(0x1CB);	// @ (0x39 * 8 + 3)
#define                                 DC0_bit             _BIT_ACCESS(CLKRCON,3)
// CLKRCON<DC1>
extern volatile __bit                   DC1                 __at(0x1CC);	// @ (0x39 * 8 + 4)
#define                                 DC1_bit             _BIT_ACCESS(CLKRCON,4)
// DMAnDCNTL<DCNT0>
extern volatile __bit                   DCNT0               __at(0x750);	// @ (0xEA * 8 + 0)
#define                                 DCNT0_bit           _BIT_ACCESS(DMAnDCNTL,0)
// DMAnDCNTL<DCNT1>
extern volatile __bit                   DCNT1               __at(0x751);	// @ (0xEA * 8 + 1)
#define                                 DCNT1_bit           _BIT_ACCESS(DMAnDCNTL,1)
// DMAnDCNTH<DCNT10>
extern volatile __bit                   DCNT10              __at(0x75A);	// @ (0xEB * 8 + 2)
#define                                 DCNT10_bit          _BIT_ACCESS(DMAnDCNTH,2)
// DMAnDCNTH<DCNT11>
extern volatile __bit                   DCNT11              __at(0x75B);	// @ (0xEB * 8 + 3)
#define                                 DCNT11_bit          _BIT_ACCESS(DMAnDCNTH,3)
// DMAnDCNTL<DCNT2>
extern volatile __bit                   DCNT2               __at(0x752);	// @ (0xEA * 8 + 2)
#define                                 DCNT2_bit           _BIT_ACCESS(DMAnDCNTL,2)
// DMAnDCNTL<DCNT3>
extern volatile __bit                   DCNT3               __at(0x753);	// @ (0xEA * 8 + 3)
#define                                 DCNT3_bit           _BIT_ACCESS(DMAnDCNTL,3)
// DMAnDCNTL<DCNT4>
extern volatile __bit                   DCNT4               __at(0x754);	// @ (0xEA * 8 + 4)
#define                                 DCNT4_bit           _BIT_ACCESS(DMAnDCNTL,4)
// DMAnDCNTL<DCNT5>
extern volatile __bit                   DCNT5               __at(0x755);	// @ (0xEA * 8 + 5)
#define                                 DCNT5_bit           _BIT_ACCESS(DMAnDCNTL,5)
// DMAnDCNTL<DCNT6>
extern volatile __bit                   DCNT6               __at(0x756);	// @ (0xEA * 8 + 6)
#define                                 DCNT6_bit           _BIT_ACCESS(DMAnDCNTL,6)
// DMAnDCNTL<DCNT7>
extern volatile __bit                   DCNT7               __at(0x757);	// @ (0xEA * 8 + 7)
#define                                 DCNT7_bit           _BIT_ACCESS(DMAnDCNTL,7)
// DMAnDCNTH<DCNT8>
extern volatile __bit                   DCNT8               __at(0x758);	// @ (0xEB * 8 + 0)
#define                                 DCNT8_bit           _BIT_ACCESS(DMAnDCNTH,0)
// DMAnDCNTH<DCNT9>
